import 'package:flutter/material.dart';

import '../../components/bottom_nav.dart';
import 'components/post.dart';

class NewsPage extends StatefulWidget {
  const NewsPage({super.key});

  @override
  State<NewsPage> createState() => _NewsPageState();
}

class _NewsPageState extends State<NewsPage> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: Container(
        decoration: const BoxDecoration(
          color: Colors.black,
        ),
        // Listview for the news page that takes the news posts. Currently mock data.
        child: ListView(children: const [
          Post(
            title:
                "Επίσκεψη του απερχόμενου Περιφερειακού Διοικητή Πυροσβεστικής Στερεάς Ελλάδας στον Αντιπεριφερειάρχη Φθιώτιδας",
            author: 'Ioannis Koutras',
            date: '12/12/2021',
            content:
                "Εθιμοτυπική επίσκεψη πραγματοποίησε ο απερχόμενος Περιφερειακός Διοικητής Πυροσβεστικής Υπηρεσίας Στερεάς Ελλάδας κ. Θεοφιλόπουλος στο γραφείο του Αντιπεριφερειάρχη ΠΕ Φθιώτιδας κ. Ηλία Σανίδα. Ο κ. Σανίδας ευχαρίστησε τον κ. Θεοφιλόπουλο για την άριστη συνεργασία, τον συνεχάρη για την εκ του αποτελέσματος επιτυχημένη θητεία στη Στερεά και την προαγωγή του σε Υποστράτηγο, και του ευχήθηκε καλή επιτυχία στα νέα καθήκοντα που αναλαμβάνει ως συντονιστής Βορείου – Νοτίου Αιγαίου και Κρήτης με έδρα την Σάμο.",
            image:
                'https://radio-net.gr/wp-content/uploads/2023/01/01-25_10-27-51-242-750x375.jpg',
          ),
          Post(
            author: 'Ioannis Koutras',
            content:
                'Τις διαμαρτυρίες του Εθνικού Αστεροσκοπείου Αθηνών (Ε.Α.Α.) και του Ελληνικού Κέντρου Θαλασσίων Ερευνών (ΕΛ.ΚΕ.Θ.Ε.) σχετικά με την προγραμματική συμφωνία του Υπουργείου Ναυτιλίας και Νησιωτικής Πολιτικής και του Ιδρύματος Τεχνολογίας και Έρευνας (Ι.Τ.Ε.) για την υλοποίηση του προγράμματος «Τάλως» έφερε στη Βουλή, ο Βουλευτής Φθιώτιδας ΣΥ.ΡΙΖ.Α.-Προοδευτική Συμμαχία και Αναπληρωτής Τομεάρχης Ανάπτυξης και Επενδύσεων, με αρμοδιότητα την Έρευνα και Τεχνολογία, Γιάννης Σαρακιώτης. Το εν λόγω πρόγραμμα, το κόστος του οποίου ανέρχεται στα 30 εκατ. ευρώ, αφορά την υλοποίηση και επιχειρησιακή λειτουργία από το Ι.Τ.Ε. με πενταετή ορίζοντα ενός συστήματος, με σκοπό την «παρακολούθηση και πρόγνωση ακραίου καιρού για την ασφάλεια της ναυσιπλοΐας». Σε συνδυασμό με δορυφορικά δεδομένα, θα εξάγονται συμπεράσματα με τελικό στόχο «την ασφάλεια της ναυσιπλοΐας, την ενίσχυση της αποτελεσματικότητας της Έρευνας και Διάσωσης στη θάλασσα, τη βελτίωση της ασφάλειας λιμενικών εγκαταστάσεων μέσω της παροχής έγκυρης και έγκαιρης μετεωρολογικής πληροφορίας στους αρμόδιους φορείς με την κάλυψη των περιοχών της Κρήτης και του Νοτίου Αιγαίου». Η συγκεκριμένη συμφωνία έχει εγείρει σειρά αντιδράσεων τόσο από το Αστεροσκοπείο όσο και το ΕΛ.ΚΕ.Θ.Ε. (συνολικά από πλευράς 4 συλλόγων εργαζομένων και των Δ.Σ. στα δύο Κέντρα), για το γεγονός ότι κατευθύνονται δημόσιοι πόροι χωρίς την παραμικρή διαβούλευση με τους καθ’ ύλην εμπλεκόμενους φορείς με στόχο ένα αμφιβόλου επιστημονικής αξίας τελικό αποτέλεσμα, καθώς το Ι.Τ.Ε. δεν διαθέτει την αναγκαία τεχνογνωσία βάσει των ερευνητικών δράσεων που έως τώρα αναλάμβανε, ενώ ανατρέπεται σε μεγάλο βαθμό ο ερευνητικός χάρτης της χώρας χωρίς την παραμικρή διαβούλευση με το Εθνικό Συμβούλιο Έρευνας, Τεχνολογίας και Καινοτομίας (Ε.Σ.Ε.ΤΕ.Κ.), αλλά και το Υπουργείο Ανάπτυξης και Επενδύσεων ως αρμοδίου για τον τομέα της Έρευνας και της Τεχνολογίας. Σύμφωνα με τον κ. Σαρακιώτη: «Η επιμονή της Κυβέρνησης της Ν.Δ. να κατευθύνει 30 εκατ. ευρώ σε ένα συγκεκριμένο ερευνητικό φορέα, ο οποίος δεν διαθέτει την ανάλογη εμπειρία υλοποίησης έργων όπως το “Τάλως”, εγείρει πολλά ερωτηματικά. Το Εθνικό Αστεροσκοπείο Αθηνών και το Ελληνικό Κέντρο Θαλασσίων Ερευνών συνιστούν δύο πολυβραβευμένους ερευνητικούς φορείς με πλούσια και πολυετή δραστηριότητα με αντικείμενο την πρόγνωση καιρού και κυματισμού στις θαλάσσιες περιοχές της χώρας, ενώ το ΕΛ.ΚΕ.Θ.Ε. έχει, μεταξύ άλλων, την ευθύνη για την καθημερινή παραγωγή και διάθεση, μέσω της ιστοσελίδας του Copernicus Marine, ποιοτικά ελεγμένων αναλύσεων και δεκαήμερων προγνώσεων ανεμογενών κυματισμών για ολόκληρη τη λεκάνη της Μεσογείου. Προφανώς δεν αρκούν τα επιτεύγματα του Ε.Α.Α. και του ΕΛ.ΚΕ.Θ.Ε. στην Κυβέρνηση της Ν.Δ. και με αδιαφανείς διαδικασίες, αποφάσισε για άγνωστους λόγους να διαθέσει δημόσιους πόρους προς έναν τρίτο φορέα, καθόλα σεβαστό και με μεγάλο αποτύπωμα στον ελληνικό και διεθνή ερευνητικό χώρο αλλά με διαφορετική αποστολή».',
            date: '02/01/2023',
            image:
                'https://radio-net.gr/wp-content/uploads/2023/01/%CE%93.-%CE%A3%CE%B1%CF%81%CE%B1%CE%BA%CE%B9%CF%8E%CF%84%CE%B7%CF%82-750x375.jpeg',
            title:
                'Γ. Σαρακιώτης: «Αδιαφανείς αποφάσεις της Κυβέρνησης με θύμα την ερευνητική κοινότητα της χώρας»',
          ),
        ]),
      ),
      bottomNavigationBar: const BottomNav(
        activeButtonIndex: 1,
      ),
    );
  }
}
